#Create and print an entire DataFrame

In [7]:
import pandas as pd

In [8]:
lst = ['Geeks', 'For', 'Geeks', 'is', 'portal', 'for', 'Geeks']

In [9]:
df = pd.DataFrame(lst)

print(df)

In [16]:
df

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [20]:
data = {'Name':['Tom', 'Ca', 'Voi', 'Pony', 'Sake'],
        'Age':[4, 4, 4, 4, 2]}

In [22]:
df = pd.DataFrame(data)

In [26]:
df[['Age','Name']]

   Age  Name
0    4   Tom
1    4    Ca
2    4   Voi
3    4  Pony
4    2  Sake

In [27]:
df.loc[1:2]

  Name  Age
1   Ca    4
2  Voi    4